tests/fixtures/vcr_cassettes/6_7/get_host.yml

---
http_interactions:
- request:
    method: post
    uri: https://<%= vsphere_server %>/sdk
    body:
      encoding: UTF-8
      string: <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Body><RetrieveProperties
        xmlns="urn:vim25"><_this type="PropertyCollector">propertyCollector</_this><specSet
        xsi:type="PropertyFilterSpec"><propSet xsi:type="PropertySpec"><type>Folder</type><pathSet>childEntity</pathSet></propSet><objectSet
        xsi:type="ObjectSpec"><obj type="Folder">group-d1</obj></objectSet></specSet></RetrieveProperties></env:Body></env:Envelope>
    headers:
      Content-Type:
      - text/xml; charset=utf-8
      Soapaction:
      - urn:vim25/6.7
      Cookie:
      - vmware_soap_session="4555248453d2c288d85b6d2112ab0060cc13775b"; Path=/; HttpOnly;
        Secure;
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 16 Apr 2019 14:20:47 GMT
      Cache-Control:
      - no-cache
      Connection:
      - Keep-Alive
      Content-Type:
      - text/xml; charset=utf-8
      X-Frame-Options:
      - DENY
      Content-Length:
      - '666'
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?>
        <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
         xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
         xmlns:xsd="http://www.w3.org/2001/XMLSchema"
         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <soapenv:Body>
        <RetrievePropertiesResponse xmlns="urn:vim25"><returnval><obj type="Folder">group-d1</obj><propSet><name>childEntity</name><val xsi:type="ArrayOfManagedObjectReference"><ManagedObjectReference type="Datacenter" xsi:type="ManagedObjectReference">datacenter-2</ManagedObjectReference></val></propSet></returnval></RetrievePropertiesResponse>
        </soapenv:Body>
        </soapenv:Envelope>
    http_version:
  recorded_at: Tue, 16 Apr 2019 14:20:48 GMT
- request:
    method: post
    uri: https://<%= vsphere_server %>/sdk
    body:
      encoding: UTF-8
      string: <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Body><RetrieveProperties
        xmlns="urn:vim25"><_this type="PropertyCollector">propertyCollector</_this><specSet
        xsi:type="PropertyFilterSpec"><propSet xsi:type="PropertySpec"><type>Datacenter</type><pathSet>name</pathSet></propSet><objectSet
        xsi:type="ObjectSpec"><obj type="Datacenter">datacenter-2</obj></objectSet></specSet></RetrieveProperties></env:Body></env:Envelope>
    headers:
      Content-Type:
      - text/xml; charset=utf-8
      Soapaction:
      - urn:vim25/6.7
      Cookie:
      - vmware_soap_session="4555248453d2c288d85b6d2112ab0060cc13775b"; Path=/; HttpOnly;
        Secure;
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 16 Apr 2019 14:20:47 GMT
      Cache-Control:
      - no-cache
      Connection:
      - Keep-Alive
      Content-Type:
      - text/xml; charset=utf-8
      X-Frame-Options:
      - DENY
      Content-Length:
      - '538'
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?>
        <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
         xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
         xmlns:xsd="http://www.w3.org/2001/XMLSchema"
         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <soapenv:Body>
        <RetrievePropertiesResponse xmlns="urn:vim25"><returnval><obj type="Datacenter">datacenter-2</obj><propSet><name>name</name><val xsi:type="xsd:string">BRQ</val></propSet></returnval></RetrievePropertiesResponse>
        </soapenv:Body>
        </soapenv:Envelope>
    http_version:
  recorded_at: Tue, 16 Apr 2019 14:20:48 GMT
- request:
    method: post
    uri: https://<%= vsphere_server %>/sdk
    body:
      encoding: UTF-8
      string: <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Body><RetrieveProperties
        xmlns="urn:vim25"><_this type="PropertyCollector">propertyCollector</_this><specSet
        xsi:type="PropertyFilterSpec"><propSet xsi:type="PropertySpec"><type>Datacenter</type><pathSet>hostFolder</pathSet></propSet><objectSet
        xsi:type="ObjectSpec"><obj type="Datacenter">datacenter-2</obj></objectSet></specSet></RetrieveProperties></env:Body></env:Envelope>
    headers:
      Content-Type:
      - text/xml; charset=utf-8
      Soapaction:
      - urn:vim25/6.7
      Cookie:
      - vmware_soap_session="4555248453d2c288d85b6d2112ab0060cc13775b"; Path=/; HttpOnly;
        Secure;
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 16 Apr 2019 14:20:47 GMT
      Cache-Control:
      - no-cache
      Connection:
      - Keep-Alive
      Content-Type:
      - text/xml; charset=utf-8
      X-Frame-Options:
      - DENY
      Content-Length:
      - '575'
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?>
        <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
         xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
         xmlns:xsd="http://www.w3.org/2001/XMLSchema"
         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <soapenv:Body>
        <RetrievePropertiesResponse xmlns="urn:vim25"><returnval><obj type="Datacenter">datacenter-2</obj><propSet><name>hostFolder</name><val type="Folder" xsi:type="ManagedObjectReference">group-h4</val></propSet></returnval></RetrievePropertiesResponse>
        </soapenv:Body>
        </soapenv:Envelope>
    http_version:
  recorded_at: Tue, 16 Apr 2019 14:20:48 GMT
- request:
    method: post
    uri: https://<%= vsphere_server %>/sdk
    body:
      encoding: UTF-8
      string: <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Body><FindChild
        xmlns="urn:vim25"><_this type="SearchIndex">SearchIndex</_this><entity type="Folder">group-h4</entity><name>esxi.example.com</name></FindChild></env:Body></env:Envelope>
    headers:
      Content-Type:
      - text/xml; charset=utf-8
      Soapaction:
      - urn:vim25/6.7
      Cookie:
      - vmware_soap_session="4555248453d2c288d85b6d2112ab0060cc13775b"; Path=/; HttpOnly;
        Secure;
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 16 Apr 2019 14:20:47 GMT
      Cache-Control:
      - no-cache
      Connection:
      - Keep-Alive
      Content-Type:
      - text/xml; charset=utf-8
      X-Frame-Options:
      - DENY
      Content-Length:
      - '439'
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?>
        <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
         xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
         xmlns:xsd="http://www.w3.org/2001/XMLSchema"
         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <soapenv:Body>
        <FindChildResponse xmlns="urn:vim25"><returnval type="ComputeResource">domain-s7</returnval></FindChildResponse>
        </soapenv:Body>
        </soapenv:Envelope>
    http_version:
  recorded_at: Tue, 16 Apr 2019 14:20:48 GMT
- request:
    method: post
    uri: https://<%= vsphere_server %>/sdk
    body:
      encoding: UTF-8
      string: <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Body><RetrieveProperties
        xmlns="urn:vim25"><_this type="PropertyCollector">propertyCollector</_this><specSet
        xsi:type="PropertyFilterSpec"><propSet xsi:type="PropertySpec"><type>ComputeResource</type><pathSet>host</pathSet></propSet><objectSet
        xsi:type="ObjectSpec"><obj type="ComputeResource">domain-s7</obj></objectSet></specSet></RetrieveProperties></env:Body></env:Envelope>
    headers:
      Content-Type:
      - text/xml; charset=utf-8
      Soapaction:
      - urn:vim25/6.7
      Cookie:
      - vmware_soap_session="4555248453d2c288d85b6d2112ab0060cc13775b"; Path=/; HttpOnly;
        Secure;
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 16 Apr 2019 14:20:48 GMT
      Cache-Control:
      - no-cache
      Connection:
      - Keep-Alive
      Content-Type:
      - text/xml; charset=utf-8
      X-Frame-Options:
      - DENY
      Content-Length:
      - '663'
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?>
        <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
         xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
         xmlns:xsd="http://www.w3.org/2001/XMLSchema"
         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <soapenv:Body>
        <RetrievePropertiesResponse xmlns="urn:vim25"><returnval><obj type="ComputeResource">domain-s7</obj><propSet><name>host</name><val xsi:type="ArrayOfManagedObjectReference"><ManagedObjectReference type="HostSystem" xsi:type="ManagedObjectReference">host-9</ManagedObjectReference></val></propSet></returnval></RetrievePropertiesResponse>
        </soapenv:Body>
        </soapenv:Envelope>
    http_version:
  recorded_at: Tue, 16 Apr 2019 14:20:48 GMT
- request:
    method: post
    uri: https://<%= vsphere_server %>/sdk
    body:
      encoding: UTF-8
      string: <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Body><RetrieveProperties
        xmlns="urn:vim25"><_this type="PropertyCollector">propertyCollector</_this><specSet
        xsi:type="PropertyFilterSpec"><propSet xsi:type="PropertySpec"><type>HostSystem</type><pathSet>name</pathSet></propSet><objectSet
        xsi:type="ObjectSpec"><obj type="HostSystem">host-9</obj></objectSet></specSet></RetrieveProperties></env:Body></env:Envelope>
    headers:
      Content-Type:
      - text/xml; charset=utf-8
      Soapaction:
      - urn:vim25/6.7
      Cookie:
      - vmware_soap_session="4555248453d2c288d85b6d2112ab0060cc13775b"; Path=/; HttpOnly;
        Secure;
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 16 Apr 2019 14:20:48 GMT
      Cache-Control:
      - no-cache
      Connection:
      - Keep-Alive
      Content-Type:
      - text/xml; charset=utf-8
      X-Frame-Options:
      - DENY
      Content-Length:
      - '568'
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?>
        <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
         xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
         xmlns:xsd="http://www.w3.org/2001/XMLSchema"
         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <soapenv:Body>
        <RetrievePropertiesResponse xmlns="urn:vim25"><returnval><obj type="HostSystem">host-9</obj><propSet><name>name</name><val xsi:type="xsd:string">esxi.example.com</val></propSet></returnval></RetrievePropertiesResponse>
        </soapenv:Body>
        </soapenv:Envelope>
    http_version:
  recorded_at: Tue, 16 Apr 2019 14:20:48 GMT
- request:
    method: post
    uri: https://<%= vsphere_server %>/sdk
    body:
      encoding: UTF-8
      string: <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Body><RetrieveProperties
        xmlns="urn:vim25"><_this type="PropertyCollector">propertyCollector</_this><specSet
        xsi:type="PropertyFilterSpec"><propSet xsi:type="PropertySpec"><type>HostSystem</type><pathSet>name</pathSet></propSet><objectSet
        xsi:type="ObjectSpec"><obj type="HostSystem">host-9</obj></objectSet></specSet></RetrieveProperties></env:Body></env:Envelope>
    headers:
      Content-Type:
      - text/xml; charset=utf-8
      Soapaction:
      - urn:vim25/6.7
      Cookie:
      - vmware_soap_session="4555248453d2c288d85b6d2112ab0060cc13775b"; Path=/; HttpOnly;
        Secure;
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 16 Apr 2019 14:20:48 GMT
      Cache-Control:
      - no-cache
      Connection:
      - Keep-Alive
      Content-Type:
      - text/xml; charset=utf-8
      X-Frame-Options:
      - DENY
      Content-Length:
      - '568'
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?>
        <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
         xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
         xmlns:xsd="http://www.w3.org/2001/XMLSchema"
         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <soapenv:Body>
        <RetrievePropertiesResponse xmlns="urn:vim25"><returnval><obj type="HostSystem">host-9</obj><propSet><name>name</name><val xsi:type="xsd:string">esxi.example.com</val></propSet></returnval></RetrievePropertiesResponse>
        </soapenv:Body>
        </soapenv:Envelope>
    http_version:
  recorded_at: Tue, 16 Apr 2019 14:20:48 GMT
recorded_with: VCR 4.0.0
